//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  3월 20일 목요일      (3주 2일차 강의) 
//-------------------------------------------------------------------------------------------
// 동적할당과 smart pointer - RAII
//-------------------------------------------------------------------------------------------
// constexpr 가 뭘까??? 알아보자
// structured-binding
//-------------------------------------------------------------------------------------------
#include<iostream>
#include<numeric>
#include"save.h"
using namespace std;

class Dog {
public:
	Dog( ) { cout << "생성" << endl; }
	~Dog() { cout << "소멸" << endl; }
};

class 스마트 {
	Dog* p;
public:
	스마트(Dog* p) : p{ p } {
	}
	~스마트() {
		delete p;
	}
};

void f()
{
	

	스마트 p{ new Dog }; //이게 RAII

	//지역에 만들어진 객체를 파괴하는 것을 보장한다. 
	throw 1;

	
}

//----------
int main()
//----------
{
	try {
		f();
	}
	catch (...) {

	}
	
	save("메인.cpp");	
}