//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  3월 13일 목요일      (2주 2일차 강의) 
//-------------------------------------------------------------------------------------------
//   많은 수의 자료를 처리하기
//
//-------------------------------------------------------------------------------------------
// 
//-------------------------------------------------------------------------------------------
#include<iostream>
#include<array>
#include<numeric>
#include"save.h"

using namespace std;


//[문제] 메모리에 저장된 bit를 그대로 파일에 저장할 수 잇다.
// -> 저수준 입출력 함수를 사용한다.




//----------
int main()
//----------
{
	array<int, 1000> a; //초기화가 되는지 확인해보자.

	iota(a.begin(), a.end(), 1); //a의 시작부터 b의 끝까지 1씩 증가시켜서 넣어줘
	
	for (int num : a) {
		cout << num << " ";
	}
	//초기화 된다
	cout << endl;
	
	save("메인.cpp");	
}