//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  3월 13일 목요일      (2주 2일차 강의) 
//-------------------------------------------------------------------------------------------
//   많은 수의 자료를 처리하기
//
//-------------------------------------------------------------------------------------------
#include<iostream>
#include<bitset>
#include<algorithm>
#include"save.h"

using namespace std;


//[문제] 파일 "int 100개.txt"에는 int 1000개가 text로 기록되어 있다.
//  int 1000개를 저장하기 위해 몇 바이트를 사용했는가?? 8200




//----------
int main()
//----------
{
	int num{ 0x01'02'03'04 };
	bitset<32>binary = num;
	cout << " 2진수 -" << binary << endl;
	cout << "10진수 -" << num << endl;
	cout << "16진수 -" << hex << num << endl;
	
	
	save("메인.cpp");	
}