//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  3월 11일 목요일      (1주 2일차 강의) 
//-------------------------------------------------------------------------------------------
//   많은 수의 자료를 처리하기
//
//-------------------------------------------------------------------------------------------
#include<iostream>
#include <random>
#include<print>
#include"save.h"

using namespace std;

default_random_engine dre; //엔전에서 막 임의의 bit를 가공한다
uniform_int_distribution uid{ 1,999'9999 };
//[문제] 랜덤 int 1000개를 메모리에 저장하라
// 가장 큰 값을 찾아 화면에 출력하라

//----------
int main()
//----------
{
	int p[1000];
	for (int i = 0; i < 1000; ++i)
		print("{:8}", uid(dre));  //나는 8 글자에 맞추어 볼래
	cout << endl;

	save("메인.cpp");	
}





