//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  3월 20일 목요일      (3주 2일차 강의) 
// 4월 24일 중간고사 8주차 2일
//-------------------------------------------------------------------------------------------
// Callable type -호출 가능한 타입
// 1.합수
// 2.합수 포인터
// 3. 람다 - 이름 없는함수 - 실체가 있어야 한다. (VS 에서는 class로 코딩해준다)
// 4. 함수 객체(function object) - 함수호출연산자를 오버로딩 한 클래스 객체
//-------------------------------------------------------------------------------------------
// 
//-------------------------------------------------------------------------------------------
#include<iostream>
#include<array>
#include<algorithm>
#include"save.h"
using namespace std;

#include<iostream>
#include<array>
#include<algorithm>
#include"save.h"
using namespace std;



//----------
int main()
//----------
{
    array<int, 10> a{ 1,3,5,7,9,2,4,6,8,10 };
    class Dog {
    public:
        bool operator()( int a,  int b) const {
            return a > b; //a에서 b쪽으로 내려가게
        }
    };
    //[문제] 다음 코드가 의도대로 실행될 수 있게 필요한 코딩을 추가하라

    sort(a.begin(), a.end(), Dog{});
    for (int num : a)
        cout << num<< " ";
    cout << endl; //10,9,8,7,6,5,4,3,2,1
    save("메인.cpp");
}