//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  3월 20일 목요일      (6주 1일차 강의) 
// 4월 24일 중간고사(30) 8주차 2일
// 과제    (30) - 4월 10일 설명
//-------------------------------------------------------------------------------------------
// STRING - std::stromg과 유사한 클래스, STL 표준 container가 되도록 발전시켜나갈것임
//-------------------------------------------------------------------------------------------
#include<iostream>
#include<string>
#include<memory>
#include"save.h"
#include"STRING.h"
using namespace std;


//----------
int main()
//------------------------------------------------------------
{
    STRING s{ "std::string과 유사한 클래스" };
    cout << s.size() << endl; //s가 확보한 자원의 바이트 수
    cout << s << endl;

    STRING t;
    t = s;

    STRING u = s;

    cout << t << endl;
    cout << s << endl;
    save("메인.cpp");
}