//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  6월 5일 목요일      (13주 2일차 강의) 
//  6월 19일 목 15주 2일 - 기말시험
//-------------------------------------------------------------------------------------------
// algorithms - cppreference
//-----------------------------------------------------
#include<iostream>
#include<algorithm>
#include<string>
#include"save.h"
#include"STRING.h"
using namespace std;



extern bool 관찰; // 관찰하려면 true로



//----------
int main()
//------------------------------------------------------------
{  
    string s{ "2025. 6. 10" };

    while (true) {
        cout << s << endl;
        //100ms 쉬고
        rotate(s.begin(), s.end(), s.begin() + 1);
    }
    save("메인.cpp");
}