//-------------------------------------------------------------------------------------------
// 2025 STL 화56 목78  3월 20일 목요일      (3주 2일차 강의) 
//-------------------------------------------------------------------------------------------
// 동적할당과 smart pointer - RAII 클래스로 자원을 관리하는 것
//  - C++ stack-unwinding을 보장한다
//-------------------------------------------------------------------------------------------
// 많은 수의 자료 - FILE
//-------------------------------------------------------------------------------------------
#include<iostream>
#include<fstream>
#include<string>
#include<array>
#include<algorithm>
#include"save.h"
using namespace std;

//[문제] "메인.cpp"의 내용 중에 소문자를 모두 대문자로 바꿔 "메인 대문자.cpp"에 저장하라

//----------
int main()
//----------
{	
    ifstream in{ "메인.cpp" };
    ofstream out{ "메인 대문자.cpp" };
    string line;
    
    while (getline(in, line)) {
        for (char& c : line) {
            c = toupper(c);
        }
        out << line << endl;
    }

    return 0;
}